erp3l/src/Documents/ЗаявкаНаКорректировкуЛимитов/ЗаявкаНаКорректировкуЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКорректировкуЛимитов</name>
  <basedOn>Document.ВерсияСоглашенияКоммерческийДоговор</basedOn>
  <basedOn>Document.ВерсияСоглашенияАккредитив</basedOn>
  <basedOn>Document.ВерсияСоглашенияБанковскаяГарантия</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютноПроцентныйСвоп</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютныйСвоп</basedOn>
  <basedOn>Document.ВерсияСоглашенияВалютныйФорвард</basedOn>
  <basedOn>Document.ВерсияСоглашенияДепозит</basedOn>
  <basedOn>Document.ВерсияСоглашенияКредит</basedOn>
  <basedOn>Document.УдалитьВерсияСоглашенияЛизинг</basedOn>
  <registerRecords>AccumulationRegister.ЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованияДокументаЗаявкаНаКорректировкуЛимитов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>DefinedType.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтчета</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПланирования</name>
      <type>
        <types>DocumentRef.ОперативныйПлан</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛимитыПоБюджетам</name>
    <attributes>
      <name>ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>DefinedType.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРезервирования</name>
      <type>
        <types>DocumentRef.ОперативныйПлан</types>
      </type>
    </attributes>
    <attributes>
      <name>Свободно</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>КОбеспечению</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОпределенияВалютыЛимитирования</name>
      <type>
        <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьЛимитирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/ЗаявкаНаКорректировкуЛимитов/Forms/ФормаВыбораПериодаЛимитирования/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидБюджета = Параметры.ВидБюджета;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВидБюджета", ВидБюджета);
	
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ВыполнитьВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ДанныеВыбора)
	Результат = Новый Структура;
	Результат.Вставить("ВидБюджета");
	Результат.Вставить("ИспользоватьЛимитирование");
	Результат.Вставить("ПериодичностьЛимитирования");
	Результат.Вставить("ПериодЛимитирования");
	Результат.Вставить("СпособОпределенияВалютыЛимитирования");
	ЗаполнитьЗначенияСвойств(Результат, ДанныеВыбора);
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти
